**Atualizando a biblioteca para plotagem de gráficos**

In [19]:
#!pip -q install plotly --upgrade

**Importando bibliotecas**

In [20]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

**Abrindo um arquivo CSV do drive**

In [21]:
base = pd.read_csv('content/sample_data/train.csv', sep=',')

**Você também pode carregar seu arquivo e já selecionar as colunas que desejar... investigue esta função**

In [22]:
#base2 = pd.read_csv('/content/sample_data/restaurante_correto.csv', ';', usecols=['Alternativo', 'Bar'])
#base2

In [23]:
base

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
print(base.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Contando quantidade de instâncias**

**Tratamento de dados categóricos**

> *LabelEncoder - Vamos tratar os dados categóricos colocando 1, 2, 3 e etc**

In [25]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OrdinalEncoder

base

In [26]:
#para codificar todos os atributos para laberEncoder de uma única vez
#base_encoded = base.apply(LabelEncoder().fit_transform)
#cols_label_encode = ['Alternativo', 'Bar', 'SexSab','fome' 'Preco', 'Chuva', 'Res','Tempo']
#ordinal_label_encode = ['Cliente']
#cliente_categories = [['Nenhum', 'Alguns', 'Cheio']]
#cliente_encoder = OrdinalEncoder(categories=cliente_categories)
#base[cols_label_encode] = base[cols_label_encode].apply(LabelEncoder().fit_transform)
#base[ordinal_label_encode] = cliente_encoder.fit_transform(base[ordinal_label_encode]).astype(int)



#base[ordinal_label_encode] = base[ordinal_label_encode].astype(int)

In [27]:
base

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
col_drop = ['PassengerId', 'Name', 'Ticket', 'Cabin']
base.drop(columns= col_drop, inplace=True)
base

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]



>** OneHotEncoder - Agora vamos binarizar atributos não ordinais**

In [29]:
col_median_null_values = ['Age']
col_mode_null_values = ['Embarked']
base[col_median_null_values] = base[col_median_null_values].fillna(base[col_median_null_values].median())
base[col_mode_null_values] = base[col_mode_null_values].fillna(base[col_mode_null_values].mode().iloc[0])
base

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female  28.0      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [30]:
cols_labels_encode = ['Sex']
cols_ordinal_encode = ['Embarked']
values_embarked = ['S', 'C', 'Q']
base[cols_labels_encode] = base[cols_labels_encode].apply(LabelEncoder().fit_transform)
embarked_encoder = OrdinalEncoder(categories=[values_embarked])
base[cols_ordinal_encode] = embarked_encoder.fit_transform(base[cols_ordinal_encode]).astype(int)

In [31]:
base

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0           0       3    1  22.0      1      0   7.2500         0
1           1       1    0  38.0      1      0  71.2833         1
2           1       3    0  26.0      0      0   7.9250         0
3           1       1    0  35.0      1      0  53.1000         0
4           0       3    1  35.0      0      0   8.0500         0
..        ...     ...  ...   ...    ...    ...      ...       ...
886         0       2    1  27.0      0      0  13.0000         0
887         1       1    0  19.0      0      0  30.0000         0
888         0       3    0  28.0      1      2  23.4500         0
889         1       1    1  26.0      0      0  30.0000         1
890         0       3    1  32.0      0      0   7.7500         2

[891 rows x 8 columns]

**Contando quantas opções de resposta tem cada atributo**

In [32]:
#len(np.unique(base['Cliente']))

In [33]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [34]:
""" cols_onehot_encode = ['Tipo']
# Inicializar o OneHotEncoder (sparse_output=False retorna um array denso)
onehot = OneHotEncoder(sparse_output=False)

# Aplicar o OneHotEncoder apenas nas colunas categóricas
df_onehot = onehot.fit_transform(base[cols_onehot_encode])

# Obter os novos nomes das colunas após a codificação
nomes_das_colunas = onehot.get_feature_names_out(cols_onehot_encode)

# Criar um DataFrame com os dados codificados e as novas colunas
df_onehot = pd.DataFrame(df_onehot, columns=nomes_das_colunas)

# Combinar as colunas codificadas com as colunas que não foram transformadas
base_encoded= pd.concat([df_onehot, base.drop(columns=cols_onehot_encode)], axis=1) """

" cols_onehot_encode = ['Tipo']\n# Inicializar o OneHotEncoder (sparse_output=False retorna um array denso)\nonehot = OneHotEncoder(sparse_output=False)\n\n# Aplicar o OneHotEncoder apenas nas colunas categóricas\ndf_onehot = onehot.fit_transform(base[cols_onehot_encode])\n\n# Obter os novos nomes das colunas após a codificação\nnomes_das_colunas = onehot.get_feature_names_out(cols_onehot_encode)\n\n# Criar um DataFrame com os dados codificados e as novas colunas\ndf_onehot = pd.DataFrame(df_onehot, columns=nomes_das_colunas)\n\n# Combinar as colunas codificadas com as colunas que não foram transformadas\nbase_encoded= pd.concat([df_onehot, base.drop(columns=cols_onehot_encode)], axis=1) "

**Separar o dataset em variáveis independentes (X_prev) e dependentes (y_classe)**

In [35]:
# Supondo que a última coluna seja o target
X_prev= base.drop(columns=['Survived'])
y_classe = base['Survived']

**Método de amostragem Holdout**

In [36]:
from sklearn.model_selection import train_test_split

In [37]:
X_prev = base.drop(columns=['Survived'], axis=1)
y_classe = base['Survived']

In [38]:
X_prev

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         3    1  22.0      1      0   7.2500         0
1         1    0  38.0      1      0  71.2833         1
2         3    0  26.0      0      0   7.9250         0
3         1    0  35.0      1      0  53.1000         0
4         3    1  35.0      0      0   8.0500         0
..      ...  ...   ...    ...    ...      ...       ...
886       2    1  27.0      0      0  13.0000         0
887       1    0  19.0      0      0  30.0000         0
888       3    0  28.0      1      2  23.4500         0
889       1    1  26.0      0      0  30.0000         1
890       3    1  32.0      0      0   7.7500         2

[891 rows x 7 columns]

In [39]:
y_classe

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [40]:
y_classe.shape

(891,)

In [41]:
#X_train_ds, X_test_ds, y_train_ds, y_test_ds = train_test_split(X, y, test_size=0.3, random_state=123, shuffle=True, stratify=y)
X_treino, X_teste, y_treino, y_teste = train_test_split(X_prev, y_classe, test_size = 0.20, random_state = 42)

In [42]:
X_treino.shape

(712, 7)

In [43]:
X_teste.shape

(179, 7)

In [44]:
X_teste

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
709       3    1  28.0      1      1  15.2458         1
439       2    1  31.0      0      0  10.5000         0
840       3    1  20.0      0      0   7.9250         0
720       2    0   6.0      0      1  33.0000         0
39        3    0  14.0      1      0  11.2417         1
..      ...  ...   ...    ...    ...      ...       ...
433       3    1  17.0      0      0   7.1250         0
773       3    1  28.0      0      0   7.2250         1
25        3    0  38.0      1      5  31.3875         0
84        2    0  17.0      0      0  10.5000         0
10        3    0   4.0      1      1  16.7000         0

[179 rows x 7 columns]

In [45]:
y_treino

331    0
733    0
382    0
704    0
813    0
      ..
106    1
270    0
860    0
435    1
102    0
Name: Survived, Length: 712, dtype: int64

In [46]:
y_teste

709    1
439    0
840    0
720    1
39     1
      ..
433    0
773    0
25     1
84     1
10     1
Name: Survived, Length: 179, dtype: int64

In [47]:
import pickle

In [48]:
with open('content/sample_data/titanic.pkl', mode = 'wb') as f:
  pickle.dump([X_treino, X_teste, y_treino, y_teste], f)